
// Печать счета и предварительного счета
//
Функция ПечатьСчета(Действие, ТекЯзык=Неопределено) Экспорт
	
	//// ....
	
	ЛимитнаяКарта = Заказ.ПосадочноеМесто.ЛимитнаяКарта;
	Если Действие="Пресчет" Тогда
		Если ЛимитнаяКарта Тогда
			Задание = ТаблицаЗадания.Добавить();
			Задание.Данные    = Перевод(НСтр("de='Oder prepayment';en='Oder prepayment';ru='Внесена предоплата'"),Язык,,ДлинаРасшифровки)+":"+ФорматСумм1(Защита.СуммаВнесеннойПредоплаты(Заказ,ЗаказДопИнф), ДлинаСуммы);
			Задание.ТипДанных = "Строка";
			Задание.Параметры = "Право,ПереводСтроки";
			
			Задание = ТаблицаЗадания.Добавить();
			Задание.Данные    = Перевод(НСтр("de='Summe zur Zahlung';en='Amount to pay';ru='Сумма к оплате'"),Язык,,ДлинаРасшифровки)+":"+ФорматСумм1(Заказ.ИтоговаяСумма-Защита.СуммаВнесеннойПредоплаты(Заказ,ЗаказДопИнф), ДлинаСуммы);
			Задание.ТипДанных = "Строка";
			Задание.Параметры = "Право,ПереводСтроки";
			
			Задание = ТаблицаЗадания.Добавить();
			Задание.Данные    = Перевод(НСтр("de='The limit for an extra order';en='The limit for an extra order';ru='Лимит дозаказа'"),Язык,,ДлинаРасшифровки)+":"+ФорматСумм1(Защита.ЛимитПоКарте(Заказ,ЗаказДопИнф)-Заказ.ИтоговаяСумма, ДлинаСуммы);
			Задание.ТипДанных = "Строка";
			Задание.Параметры = "Право,ПереводСтроки";
		Иначе
			ДобавитьИнформациюПоНеплательщику(ТаблицаЗадания, ДлинаРасшифровки, ДлинаСуммы);
		КонецЕсли; 
	КонецЕсли; 
	
	ДобавитьИнформациюПоКлиенту(ТаблицаЗадания, Заказ.Клиент);
	
	// KilBil_БонуснаяСистема
	//// {
	Если KilBil_БонуснаяСистема.ИспользоватьБонуснуюСистему() Тогда
		KilBil_ТрактиръFrontOffice_4.ДобавитьИнформациюПоБонуснойКарте(Действие, ТаблицаЗадания, Заказ);	
	КонецЕсли; 
	//// }
	
	//// ....
	
КонецФункции
