
// Формирование таблицы задания для печати чека
//
Функция ПечатьЧека(ПротоколРасчетов, ОплаченнаяСумма, Знач ГруппаОплаты, ПротоколРасчетовСсылка = Неопределено) Экспорт
	
	//// ....
	
	//-------------------------------------------
	// если осталось что платить
	Если Заказ.ИтоговаяСумма > ОплаченнаяСумма Тогда
		
		//-------------------------------------------
		// из регистрируемой суммы надо вычесть уже внесенную предоплату и суммы по вариантам оплат без регистрации
		// и все это распределить по отделам
		НерегистрируемаяСумма = ОплаченнаяСумма;
		ДопПараметры = Новый Структура("ПротоколРасчетов, НерегистрируемаяСумма", ПротоколРасчетов, НерегистрируемаяСумма);
		ТаблицаЗаданияДобавить("НеРегистрируемыйВариантОплатыТекст", ДопПараметры);
		НерегистрируемаяСумма = ДопПараметры.НерегистрируемаяСумма;
		
		ИтогПоОтделам = ТаблицаТоваровДляККМ.Итог("СуммаРеализации");
		
		Если ИтогПоОтделам <= 0 ИЛИ ТаблицаТоваровДляККМ.Найти(Истина,"Регистрировать") = Неопределено Тогда
			// т.е. после всех вычетов регистрировать нечего
			Действие="Печать";
			
			// если вдруг сделали нерегистрируемый нал, то может еще и сдача быть
			Если ИтогПоОтделам < 0 Тогда
				ТаблицаЗаданияДобавить("СдачаТекст", ИтогПоОтделам);
			КонецЕсли;
			
		Иначе
			
			ТаблицаЗаданияДобавить("Регистрация", ТаблицаТоваровДляККМ);
			
		КонецЕсли;
		
		//ТаблицаЗаданияДобавить("НДСТекст", ТаблицаОтделовИтогСумма - ОплаченнаяСумма); ТаблицаТоваровДляККМ
		ТаблицаЗаданияДобавить("НДСТекст", ТаблицаТоваровДляККМ); 
		
	//-------------------------------------------
	// иначе надо вернуть разницу
	ИначеЕсли Заказ.ИтоговаяСумма < ОплаченнаяСумма Тогда
		
		НерегистрируемаяСумма = 0;
		//ДобавитьНерегистрируемыеВариантыОплаты(ПротоколРасчетов, НерегистрируемаяСумма);
		ДопПараметры = Новый Структура("ПротоколРасчетов, НерегистрируемаяСумма", ПротоколРасчетов, НерегистрируемаяСумма);
		ТаблицаЗаданияДобавить("ВозвратПредоплатыТекст", ДопПараметры);
		НерегистрируемаяСумма = ДопПараметры.НерегистрируемаяСумма;
		
		СуммаВозврата = ОплаченнаяСумма - Заказ.ИтоговаяСумма - НерегистрируемаяСумма;
		//СуммаВозврата = ОплаченнаяСумма - Заказ.ИтоговаяСумма - ДопПараметры.НерегистрируемаяСумма;
		
		Если СуммаВозврата = 0 Тогда
			// т.е. после всех вычетов регистрировать нечего
			Действие="Печать";
		Иначе
			
			// Нужно ли проверять нал в ККМ
			ТаблицаЗаданияДобавить("ВозвратПредоплаты", Новый Структура("ПротоколРасчетов, СуммаВозврата", ПротоколРасчетов, СуммаВозврата));
			
		КонецЕсли;
		
	//-------------------------------------------
	// нечего регистрировать, просто печатаем информацию по заказу
	Иначе
		
		Действие="Печать";
		
		ТаблицаЗаданияДобавить("ОплаченПолностьюТекст");	
		
	КонецЕсли;
	
	// KilBil_БонуснаяСистема
	//// }
	Если KilBil_БонуснаяСистема.ИспользоватьБонуснуюСистему() Тогда
		KilBil_ТрактиръFrontOffice_4.ДобавитьИнформациюПоБонуснойКарте(Действие, ТаблицаЗадания, Заказ);
	КонецЕсли; 	
	//// }
	
	//// ....
	
КонецФункции
